{"data":{"site":{"siteMetadata":{"title":"learn gatsby","author":"@NHF"}},"markdownRemark":{"id":"6a2c1a4c-4cb0-5a5a-a61e-b10bd10a4900","html":"<h1>f</h1>\n<p>How To Do The Malasana Stretch To Flush Your Colon and Increase Circulationmalasana stretch</p>\n<p>The Malasana stretch, also known as the Garland pose, is a yoga position that involves squatting. We all know that yoga moves are meant to be energizing and beneficial, but this particular pose truly takes the cake when it comes to positive results!</p>\n<p>Most people practice yoga for fitness and flexibility. But some poses have additional benefits. The Malasana, in particular, has the impressive ability to improve digestion by clearing out the colon. It’s also great for boosting circulation, making it a fantastic pose for the whole body.</p>\n<p>But how do you do the Malasana pose at all, especially if you’ve never done yoga? Why is it so good? What scientific evidence is there that suggests it works? If you’re asking these questions, we’ve got you covered. Here is how to do the Malasana stretch to flush your colon and increase circulation.</p>\n<p>HOW TO DO THE MALASANA STRETCH TO FLUSH YOUR COLON AND INCREASE CIRCULATION</p>\n<ol>\n<li>WHAT IS THE MALASANA STRETCH?\nThe Malasana stretch is a squatting type of pose that involves an individual’s hips and pelvis being placed lower than their knees. It earned its name from “Mala,” a Sanskrit word that translates to “garland.” This is why some people call this pose the Garland Pose. In modern yoga practices, it is often called the yoga squat.</li>\n</ol>\n<p>As a pose, the Malasana stretch is fairly simple. All that is required is a balanced low squat, whereby the performer appears to mimic a garland-like shape. It is known for strengthening many parts of the lower body, and it has many additional benefits.</p>\n<ol start=\"2\">\n<li>WHY IS THE MALASANA STRETCH SO POPULAR?\nHow, exactly, did something like squatting become a yoga pose? Well, the act of squatting has been a common activity for many people since the dawn of mankind, and it’s a very natural pose for humans. Think about it – very young children and toddlers often squat automatically just for fun!</li>\n</ol>\n<p>Many countries, however, have abandoned the squat. With all the chairs and similar types of furniture around, it simply isn’t as possible a position to naturally take. This new way of sitting keeps our bodies stuck at a 90-degree, and it also makes us more likely to slouch. This reduces our mobility and takes away a lot of the natural, positive bodily gifts we were given and that our ancestors took advantage of – gifts we’ve squandered today.</p>\n<p>The Malasana squat keeps our bodies at a different angle – approximately 160 degrees. This allows the joints to stay strong and fit so it is easier to keep going well into old age. This pose is also a kind of forward bend which exercises many parts of the body without straining them, including:</p>\n<p>Stretching and strengthening feet\nFlexing the legs to release stress\nKeeping the spine elongated\nSoftening the back\nBroadening the muscles in the back\nRooting the hips and providing them with more mobility\nReleasing tension throughout the body\nAllowing more awareness of one’s body in general\nIn many parts of Asia – especially in India – you will still be able to see many people who sit in a very similar way to the Malasana stretch in their day-to-day lives! Squatting has many benefits for human beings that sitting simply does not. That’s why the Malasana stretch is so widely practiced among yogis; it brings us back to the basics and centers the body in a natural way.</p>\n<ol start=\"3\">\n<li>WHAT YOU SHOULD KNOW BEFORE DOING THE MALASANA STRETCH\nFirst, before attempting the pose, allow yourself to wait between four and six hours after a meal. You should not try this pose on a full stomach and ideally should wait for your last meal to be digested before giving it a go. In addition, try to keep your bowels clear as well before starting.</li>\n</ol>\n<p>The best time to practice any pose in yoga is first thing when you wake up in the morning.\nOf course, this is not always possible, and your next best bet for practice times is in the evening.\nIt is helpful if you ease yourself into it, especially if this is your first time doing any kind of yoga.\nWhen you start the pose, keep in mind that your torso and spine should be held straight throughout. To keep your knees and hips from becoming strained, do not bounce up and down while squatting. In general, you should try to move slowly and in a smooth fashion without forcing movements or jerking around.</p>\n<p>In addition, if you have any kind of leg or back injury, you may not be suited for this position. Speak to your doctor before attempting it to avoid further injury.</p>\n<ol start=\"4\">\n<li>HOW TO DO THE MALASANA STRETCH\nThe Malasana stretch is a fairly easy pose to use. Start by entering a normal squatting position, with your feet as near to one another as you are able to make them. Your feet should also be mostly parallel.</li>\n</ol>\n<p>It’s also a good idea to keep your heels pressed against the floor. If you are unable to do so, use support in the form of a rolled or folded blanket or mat.</p>\n<p>INSTRUCTIONS\nSet your thighs so they are at a position slightly wider apart than the width of your torso. Now, exhale and lean your torso forward so that you fit between the two thighs with ease. Allow the front of your ankles to relax and keep tension off of them.\nTake your elbows and press them against the inside of your knees. This will cause resistance to form. As you do so, take your hands and center them, palms pressed against each other, so they rest in front of the middle of your chest in a prayer position.\nWhy do you do all these seemingly small steps? It’s simple – these all help to elongate your torso. Just make sure your body weight is pressed forward and not backward as you do so. If this is difficult, seek a natural incline and perform the stretch there.\nNow, you will need to deepen the pose. Concentrate on your inner thighs and squeeze them against your torso’s sides. As you do so, extend your arms forwards, allowing your shins to slip upwards to fit into your armpits.\nFinally, move your hands to their final position. You can opt to press them into the floor beneath for stability, or use them to hold onto the backs of each heel on your feet. If you choose the latter, make sure your hands are coming from outside to your heels, not from in. Make sure your shoulders feel calm and relaxed and keep your spine nice and straight.\nAll that is left is for you to hold the pose! Beginners can just hold it for 30 seconds before moving on. Practice regularly and try to work your way up until you’re sustaining the Malasana stretch for five minutes!\nAFTER THE STRETCH\nTo come out of the pose, inhale and then release the position. The best transition is to the standing forward bend yoga pose, but you can release to any other position you’re comfortable with.</p>\n<ol start=\"5\">\n<li>MODIFICATIONS OR VARIATIONS OF THE MALASANA\nThere are various reasons that the Malasana stretch may not work for you as we’ve described it. It may be too difficult, too painful, or perhaps too easy for you. Luckily, there are some other simpler ways to perform the stretch. In addition, there are minor modifications you can make to the Malasana stretch as you learn to do it properly. Here are some of them.</li>\n</ol>\n<p>A)    BEGINNER’S PRACTICE\nYou may find it difficult to enter the squatting position when you first try the Malasana stretch. In this case, start by sitting on the very end of a chair so your thighs and torso are at a 90-degree angle from each other.</p>\n<p>Now, set the heels of your feet on the ground, just slightly in front of your knees. Start to lean forward until you are able to get your torso to rest between your knees. Continue to do this and your body will gain flexibility to complete the full pose one day.</p>\n<p>B)    BALANCING PRACTICE\nIf you tend to tip over in the pose, practice the stretch by doing it against a wall or chair. You can also do this in front of furniture, outstretching your arms to grasp it for balance.</p>\n<p>C)    PAIN RELIEF VARIATIONS\nIf you often feel painful knee pressure when doing this stretch, fold a blanket and put it at the backs of your knees so you can squat with less pain.</p>\n<p>If you experience lower back pain when doing this stretch, spread a blanket – preferably thin and folded – over your thighs. As you enter the squat, reach out with your palms.</p>\n<p>D)    ADVANCED POSES\nMake the Malasana stretch more intense by including an extra stretch. Simply place one of your hands on the floor right next to the inside of a foot, then raise your other free hand and arm upwards as high as you can. Twist your body and hold the pose. You should then do the same again by switching which hand goes where.</p>\n<ol start=\"6\">\n<li>BENEFITS OF THE MALASANA STRETCH FOR THE COLON</li>\n</ol>","excerpt":"f How To Do The Malasana Stretch To Flush Your Colon and Increase Circulationmalasana stretch The Malasana stretch, also known as the Garland pose, is a yoga…","frontmatter":{"title":"React 异常","date":"2019-01-31"}}},"pageContext":{"slug":"/React/","previous":null,"next":null}}